class Script(object):

    START_MSG = """<b>😊 ʜᴇʟʟᴏ  {},

ɪ ᴀᴍ ᴛʜᴇ ᴀᴅᴠᴀɴᴄᴇᴅ ғɪʟᴛᴇʀ ʙᴏᴛ ғᴏʀ

=>> @UM_Requests .🛡️👉ᴊᴏɪɴ

ɪ ᴄᴀɴ ᴄᴀɴ ғɪʟᴛᴇʀ ᴛᴇxᴛ ᴀs ᴘᴇʀ ᴀᴅᴍɪɴ's ᴡɪsʜ.

⚜️ ᴅᴇᴠᴇʟᴏᴘᴇᴅ ʙʏ 👉 @Deeks_04_8.

⚔️ © @UNI_MOVIES_BOX 🏅

"""


    HELP_MSG = """
🔰 𝐁𝐚𝐬𝐢𝐜 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬

/start - ᴄʜᴇᴄᴋ ɪғ ɪ ᴀᴍ ᴀʟɪᴠᴇ ᴏʀ ɴᴏᴛ

/help - ʜᴇʟᴘs ʏᴏᴜ, ʜᴏᴡ ᴛᴏ ᴜsᴇ ᴍᴇ

/about - ᴛᴏ ᴋɴᴏᴡ ᴀʙᴏᴜᴛ ᴍʏ ᴘᴇʀsᴏɴᴀʟ ɪɴғᴏʀᴍᴀᴛɪᴏɴ 

🔰 𝐅𝐢𝐥𝐭𝐞𝐫 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬

/add name reply - ᴀᴅᴅ ғɪʟᴛᴇʀ ғᴏʀ sᴘᴇᴄɪғɪᴄ ɴᴀᴍᴇs

/del name - ʀᴇᴍᴏᴠᴇ ᴛʜᴇ sᴘᴇᴄɪғɪᴇᴅ ғɪʟᴛᴇʀ ɴᴀᴍᴇ

/delall - ʀᴇᴍᴏᴠᴇ ᴇɴᴛɪʀᴇ ғɪʟᴛᴇʀs (ɢʀᴏᴜᴘ ᴏᴡɴᴇʀ ᴏɴʟʏ!)

/viewfilters - sʜᴏᴡs ᴛʜᴇ ʟɪsᴛ ᴏғ ᴀʟʟ ғɪʟᴛᴇʀs


🔰 𝐂𝐨𝐧𝐧𝐞𝐜𝐭𝐢𝐨𝐧 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬

/connect groupid - ᴛᴏ ᴄᴏɴɴᴇᴄᴛ ᴛʜᴇ ɢʀᴏᴜᴘ. ʏᴏᴜ ᴄᴀɴ ᴀʟsᴏ sɪᴍᴘʟʏ ᴜsᴇ,
/connect ɪɴ ɢʀᴏᴜᴘs.

/connections - ᴛᴏ ᴍᴀɴᴀɢᴇ ᴛʜᴇ ᴄᴏɴɴᴇᴄᴛɪᴏɴ ᴏғ ᴄᴏɴɴᴇᴄᴛᴇᴅ ɢʀᴏᴜᴘs.


🔰 𝐌𝐢𝐬𝐜

/status - sʜᴏᴡs ᴄᴜʀʀᴇɴᴛ sᴛᴀᴛᴜs ᴏғ ʏᴏᴜʀ ʙᴏᴛ (ᴀᴜᴛʜ ᴜsᴇʀ ᴏɴʟʏ)

/id - sʜᴏᴡs ᴛʜᴇ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴏғ ᴛʜᴇ ɪᴅ

/info userid - sʜᴏᴡs ᴜsᴇʀ ɪɴғᴏʀᴍᴀᴛɪᴏɴ. ᴜsᴇ /info ᴀs ʀᴇᴘʟʏ ᴛᴏ sᴏᴍᴇ ᴍᴇssᴀɢᴇ ғᴏʀ ᴛʜᴇɪʀ ᴅᴇᴛᴀɪʟs!


  🛡️ © @UNI_MOVIES_BOX |  @Deeks_04_8 🔰 """






    ABOUT_MSG = """📕 𝐀𝐛𝐨𝐮𝐭 𝐌𝐞 ,

○ ᴍʏ ɴᴀᴍᴇ :  ᴀ sᴀᴍᴘʟᴇ ᴍᴏᴠɪᴇ ᴅᴏɴᴇʀ ʙᴏᴛ

○ ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ 

○ ғʀᴀᴍᴇᴡᴏʀᴋ : ᴘʏʀᴏɢʀᴀᴍ 

○ sᴇʀᴠᴇʀ : ʜᴇʀᴏᴋᴜ 

○ ᴠᴇʀsɪᴏɴ : 5.0.0

○ sᴏᴜʀᴄᴇ ᴄᴏᴅᴇ : sᴏᴏɴ ᴀᴠᴀɪʟᴀʙʟᴇ 

○ ᴄʀᴇᴀᴛᴏʀ : @Deeks_04_8

ᴜᴘᴅᴀᴛᴇᴅ ᴏɴ 02-5-2021 ɪɴᴅɪᴀɴ ᴛɪᴍᴇ 12:00 ᴀᴍ
"""
